Table of Contents
 Class CrossSectionProjectItem
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
Identification of an crossection item in the Idea project
[DataContract]
public class CrossSectionProjectItem : ProjectItem
Inheritance
object
ProjectItem
CrossSectionProjectItem
Inherited Members
 ProjectItem.Identifier
 ProjectItem.Name
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Properties
 MaterialIdentifier
Id of the material item in the idea project
[DataMember]
public int MaterialIdentifier { get; set; }
Property Value
int
 MaterialName
Name of the material item in the idea project
[DataMember]
public string MaterialName { get; set; }
Property Value
string
 Edit this page